{
    "header": {
        "description": "The most reliable way to track ICE activity near you."
    },
    "home": {
        "header": "ICE Activity Tracker",
        "description": "The most reliable way to track ICE activity near you."
    },
    "donate-button": {
        "title": "Donate"
    },
    "reporting": {
        "title": "Reporting ICE Activity",
        "notice": "Help keep your community informed and safe",
        "subTitle1": "What to Report",
        "info1": "ICE vehicles, checkpoints, or detainments.",
        "subTitle2": "Where",
        "info2": "Use the Location bar to share exact details (intersections, addresses, or landmarks).",
        "subTitle3": "When",
        "info3": "Submit reports as soon as it’s safe for you to do so.",
        "subTitle4": "Privacy",
        "info4": "All reports are completely anonymous."
    },
    "emergencyContacts": {
        "title": "Emergency Contacts",
        "subTitle1": "Legal aid Hotlines",
        "info1": "Keep the phone numbers for reliable immigration legal aid organizations handy. They can explain your rights, connect you with attorneys, and guide you through ICE encounters.",
        "subTitle2": "Rapid Response Networks",
        "info2": "Identify local immigrant or rapid-response groups that can assist if someone is detained. They may provide on-the-ground support, advocacy, and connections to bail or legal resources.",
        "subTitle3": "Trusted Contacts",
        "info3": "Make sure at least one friend, family member, or trusted person knows your location and can check in if needed.",
        "top": "Keeping important contacts accessible can help you and your loved ones stay safe in unexpected situations.",
        "bottom": "Store these numbers in your phone, in a wallet, or on a “Know Your Rights” card. Consider keeping a small paper list as backup in case your phone is lost or confiscated."
    },
    "reportsList": {
        "title": "Recent Reports",
        "loading": "Loading verified reports...",
        "noReports": "No Reports",
        "noReportsMatching": "No reports found matching \"{searchQuery}\"",
        "viewMore": "View More ({count} more reports)",
        "showLess": "Show Less",
        "betaBadge": "Beta",
        "description": "Latest community alerts in your area"
    },
    "map": {
        "loading": "Loading ICE reports...",
        "popup": {
            "title": "🚨 ICE Report",
            "additionalDetails": "ℹ️ Additional Details:",
            "reported": "Reported: {date}"
        }
    },
    "knowYourRights": {
        "title": "Know Your Rights",
        "description": "If ICE Approaches You",
        "infoT1": "Right to Remain Silent",
        "infoD1": "You do not have to answer questions about your immigration status, where you were born, or your citizenship.",
        "infoT2": "Documents",
        "infoD2": "You do not have to show documents unless you are driving a vehicle and legally required to show your license and registration.",
        "infoT3": "Refuse Searches",
        "infoD3": "You have the right to refuse searches. You do not have to consent to a search of yourself, your belongings, or your home without a warrant.",
        "infoT4": "Request an Attorney",
        "infoD4": "You have the right to speak with a lawyer before answering questions.",
        "infoT5": "Do Not Sign Anything",
        "infoD5": "Never sign documents from ICE without consulting a lawyer.",
        "infoT6": "Phone Call Rights",
        "infoD6": "If detained, you have the right to make a phone call to a lawyer or trusted contact."
    },
    "footer": {
        "disclaimer": "For immediate emergencies, contact local emergency services. For immigration legal help, contact qualified legal aid organizations.",
        "rights": "Know Your Rights →"
    },
    "common": {
        "hide": "Hide",
        "close": "✕",
        "required": "*",
        "optional": "(optional)"
    },
    "reportNumbers": {
        "totalReports": "Total Reports",
        "todayReports": "Today Reports",
        "weekReports": "Week Reports"
    },
    "addressForm": {
        "title": "Report ICE Activity",
        "description": "Help your community by reporting ICE activity in your area",
        "address": {
            "label": "Address",
            "required": "Address is required",
            "placeholder": "Enter the address or location"
        },
        "additionalInfo": {
            "label": "Additional Information",
            "required": "Additional information is required",
            "placeholder": "Provide details about the activity"
        },
        "image": {
            "label": "Photo Evidence *",
            "takePhoto": "Take photo with Camera",
            "uploadGallery": "Upload from Gallery",
            "uploadPhoto": "Upload Photo",
            "retake": "Retake",
            "change": "Change",
            "uploadDifferent": "Upload Different",
            "takeOrUpload": "Take a photo with your camera or upload from gallery",
            "uploadInfo": "Upload a photo (JPG, PNG, WebP, or HEIC - Max 5MB)",
            "required": "Image is required",
            "maxSize": "Max file size is 5MB",
            "invalidType": "Only .jpg, .jpeg, .png, .webp and .heic formats are supported"
        },
        "buttons": {
            "submit": "Submit Report",
            "locating": "📍 Locating..."
        },
        "errors": {
            "generic": "An error occurred while submitting the form",
            "network": "Network error. Please check your connection and try again."
        },
        "success": {
            "message": "Successfully added location",
            "thanks": "Thank you for helping protect your community."
        },
        "privacyNotice": "All reports are completely anonymous. Your personal information will not be shared."
    },
    "aboutPage": {
        "title": "About Us",
        "description": "Community-driven protection for the neighborhoods we call home",
        "missionTitle": "Our Mission",
        "missionDescription": "We are UC San Diego alumni who grew up in Los Angeles and share a deep appreciation towards the community that shaped us. Iceinmyarea.org was created from our desire to use the education and opportunities we've been fortunate to receive to give back to neighborhoods, friends, and families that helped us grow. Our mission is to help keep our communities informed, connected, and safe. For us, this is much more than a project, it is a way to protect and uplift the city that we admire and the neighbors we care about.",
        "cTitle1": "Community First",
        "cDescription1": "Built by the community, for the community. We believe in the power of collective awareness and mutual support.",
        "cTitle2": "Safety & Privacy",
        "cDescription2": "Your safety is our priority. We protect your privacy while keeping you informed about ICE activity in your area.",
        "cTitle3": "Giving Back",
        "cDescription3": "Using our education and opportunities to protect the neighborhoods and families that helped us grow.",
        "webTitle": "Why the Website Changed",
        "webPara1": "Our website has grown rapidly, with thousands of people across the U.S. reporting ICE activity every day. With over",
        "webPara2": "4,000 daily visitors",
        "webPara3": ", we've improved how reports are verified to make our information more",
        "webPara4": "accurate, trustworthy, and useful",
        "webPara5": "for the community.",
        "webPara6": "Every report is now",
        "webPara7": "reviewed by a real person",
        "webPara8": "to confirm its accuracy — making our platform one of the",
        "webPara9": "most reliable tools for tracking ICE activity",
        "webPara10": "nationwide.",
        "verifyTitle": "How Reports Are Verified",
        "verifyDescription": "Scroll through our three-step verification process to see how we ensure accuracy and reliability",
        "contactTitle": "Contact Us",
        "contactP1": "Have questions or need assistance? We're here to help.",
        "contactP2": "For emergencies or immediate legal assistance, please contact an immigration lawyer or legal aid organization directly."
    },
    "verificationTimeline": {
        "step1": {
            "title": "Report Submitted",
            "description": "A community member submits a report with details and location.",
            "info": "Reports include location, time, additional information, and photo evidence."
        },
        "step2": {
            "title": "Reviewed by a Person",
            "description": "A real verifier checks accuracy and context.",
            "info": "Our verification team cross-references details, checks for duplicates, and confirms authenticity."
        },
        "step3": {
            "title": "Visible in Real Time",
            "description": "Verified reports appear live for everyone.",
            "info": "Verified reports appear on the map instantly, helping communities stay informed and safe."
        }
    },
    "resourcesPage": {
        "title": "Resources",
        "description": "Here are some helpful resources to know your rights and find legal assistance.",
        "subTitle1": "Steps to Take if a Loved One is Detained",
        "resource1": {
            "title": "Confirming Detainment by ICE",
            "description": "Use the ICE Detainee Locator System to confirm their location and status. Have the person's full name, date of birth, and country of origin ready.",
            "button": "ICE Detainee Locator"
        },
        "resource2": {
            "title": "Reach Your Loved One",
            "description": "Find detention facility contact information, visitation rules, and communication guidelines to stay connected with detained loved ones.",
            "button": "Detention Facilities"
        },
        "subTitle2": "Additional Resources",
        "resource3": {
            "title": "Find Legal Help Near You",
            "description": "Search the National Immigration Legal Services Directory to locate free or low-cost legal aid organizations across the U.S.",
            "button": "Find Legal Services"
        },
        "resource4": {
            "title": "Carry Your Rights With You",
            "description": "Wallet-sized Know Your Rights card from the Immigrant Legal Resource Center (ILRC). Available in multiple languages.",
            "button": "Download Card"
        },
        "resource5": {
            "title": "We Have Rights",
            "description": "Emergency Plan and Resources from Brooklyn Defender Services. Step-by-step guide for ICE encounters with videos and legal resources.",
            "button": "View Resources"
        }
    },
    "donate-popup": {
        "title": "Support Our Mission",
        "description": "Help us keep this vital safety resource free and accessible",
        "reason": "Every donation helps us cover the costs of verifying location accuracy, maintaining our servers, and using essential online tools that power the site. Your contribution keeps the platform online, reliable, and accessible—so communities can stay informed and safe.",
        "num1": "Free Access",
        "num2": "Monitoring",
        "button1": "Donate Now",
        "button2": "Maybe Later",
        "footer": "We're a community-driven initiative. Thank you for your consideration."
    },
    "maintenance": {
        "title": "Section Under Maintenance",
        "message": "Maintenance is currently ongoing, reporting will be available as soon as possible."
    }
}