{
    "header": {
        "description": "La forma más confiable de rastrear la actividad de ICE cerca de ti."
    },
    "home": {
        "header": "Rastreador de Actividad de ICE",
        "description": "La forma más confiable de rastrear la actividad de ICE cerca de ti."
    },
    "donate-button": {
        "title": "Donar"
    },
    "reporting": {
        "title": "Reportar Actividad de ICE",
        "notice": "Ayuda a mantener informada y segura a tu comunidad",
        "subTitle1": "Qué Reportar",
        "info1": "Vehículos de ICE, retenes o detenciones.",
        "subTitle2": "Dónde",
        "info2": "Usa la barra de Ubicación para compartir detalles exactos (cruces, direcciones o lugares reconocidos).",
        "subTitle3": "Cuándo",
        "info3": "Envía reportes tan pronto como sea seguro para ti hacerlo.",
        "subTitle4": "Privacidad",
        "info4": "Todos los reportes son completamente anónimos."
    },
    "emergencyContacts": {
        "title": "Contactos de Emergencia",
        "subTitle1": "Líneas de Ayuda Legal",
        "info1": "Ten a la mano los números de organizaciones confiables que ofrecen ayuda legal en temas de inmigración. Ellas pueden explicarte tus derechos, conectarte con abogados y orientarte durante encuentros con ICE.",
        "subTitle2": "Redes de Respuesta Rápida",
        "info2": "Identifica grupos locales de apoyo a inmigrantes o de respuesta rápida que puedan ayudar si alguien es detenido. Pueden brindar apoyo en el terreno, abogacía y conexión con recursos legales o de fianza.",
        "subTitle3": "Contactos de Confianza",
        "info3": "Asegúrate de que al menos un amigo, familiar o persona de confianza sepa dónde estás y pueda comunicarse contigo si es necesario.",
        "top": "Tener contactos importantes accesibles puede ayudarte a ti y a tus seres queridos a mantenerse seguros en situaciones inesperadas.",
        "bottom": "Guarda estos números en tu teléfono, en tu cartera o en una tarjeta de “Conoce Tus Derechos”. Considera mantener una pequeña lista en papel como respaldo en caso de que tu teléfono se pierda o sea confiscado."
    },
    "reportsList": {
        "title": "Reportes Recientes",
        "loading": "Cargando reportes verificados...",
        "noReports": "Sin Reportes",
        "noReportsMatching": "No se encontraron reportes que coincidan con \"{searchQuery}\"",
        "viewMore": "Ver Más ({count} reportes adicionales)",
        "showLess": "Mostrar Menos",
        "betaBadge": "Beta",
        "description": "Alertas más recientes de la comunidad en tu área"
    },
    "map": {
        "loading": "Cargando reportes de ICE...",
        "popup": {
            "title": "🚨 Reporte de ICE",
            "additionalDetails": "ℹ️ Detalles adicionales:",
            "reported": "Reportado: {date}"
        }
    },
    "knowYourRights": {
        "title": "Conoce Tus Derechos",
        "description": "Si ICE se Acerca a Ti",
        "infoT1": "Derecho a Permanecer en Silencio",
        "infoD1": "No tienes que responder preguntas sobre tu estatus migratorio, dónde naciste o tu ciudadanía.",
        "infoT2": "Documentos",
        "infoD2": "No tienes que mostrar documentos a menos que estés conduciendo un vehículo y la ley te exija mostrar tu licencia y registro.",
        "infoT3": "Negarte a Búsquedas",
        "infoD3": "Tienes derecho a negarte a búsquedas. No tienes que dar consentimiento para que revisen tu persona, tus pertenencias o tu hogar sin una orden.",
        "infoT4": "Pedir un Abogado",
        "infoD4": "Tienes derecho a hablar con un abogado antes de responder preguntas.",
        "infoT5": "No Firmes Nada",
        "infoD5": "Nunca firmes documentos de ICE sin consultar a un abogado.",
        "infoT6": "Derechos de Llamada Telefónica",
        "infoD6": "Si eres detenido, tienes derecho a hacer una llamada telefónica a un abogado o a un contacto de confianza."
    },
    "footer": {
        "disclaimer": "Para emergencias inmediatas, contacta a los servicios de emergencia locales. Para ayuda legal de inmigración, comunícate con organizaciones calificadas de asistencia legal.",
        "rights": "Conoce Tus Derechos →"
    },
    "common": {
        "hide": "Ocultar",
        "close": "✕",
        "required": "*",
        "optional": "(opcional)"
    },
    "reportNumbers": {
        "totalReports": "Total de Reportes",
        "todayReports": "Reportes de Hoy",
        "weekReports": "Reportes de la Semana"
    },
    "addressForm": {
        "title": "Reportar Actividad de ICE",
        "description": "Ayuda a tu comunidad reportando actividad de ICE en tu área",
        "address": {
            "label": "Dirección",
            "required": "La dirección es requerida",
            "placeholder": "Ingresa la dirección o ubicación"
        },
        "additionalInfo": {
            "label": "Información Adicional",
            "required": "La información adicional es requerida",
            "placeholder": "Proporciona detalles sobre la actividad"
        },
        "image": {
            "label": "Evidencia Fotográfica *",
            "takePhoto": "Tomar foto con la Cámara",
            "uploadGallery": "Subir desde la Galería",
            "uploadPhoto": "Subir Foto",
            "retake": "Volver a Tomar",
            "change": "Cambiar",
            "uploadDifferent": "Subir Diferente",
            "takeOrUpload": "Toma una foto con tu cámara o súbela desde la galería",
            "uploadInfo": "Sube una foto (JPG, PNG, WebP o HEIC - Máx 5MB)",
            "required": "La imagen es obligatoria",
            "maxSize": "El tamaño máximo del archivo es 5MB",
            "invalidType": "Solo se permiten formatos .jpg, .jpeg, .png, .webp y .heic"
        },
        "buttons": {
            "submit": "Enviar Reporte",
            "locating": "📍 Localizando..."
        },
        "errors": {
            "generic": "Ocurrió un error al enviar el formulario",
            "network": "Error de red. Verifica tu conexión e inténtalo nuevamente."
        },
        "success": {
            "message": "Ubicación agregada exitosamente",
            "thanks": "Gracias por ayudar a proteger tu comunidad."
        },
        "privacyNotice": "Todos los reportes son completamente anónimos. Tu información personal no será compartida."
    },
    "aboutPage": {
        "title": "Sobre Nosotros",
        "description": "Protección impulsada por la comunidad para los vecindarios que llamamos hogar",
        "missionTitle": "Nuestra Misión",
        "missionDescription": "Somos exalumnos de UC San Diego que crecimos en Los Ángeles y compartimos un profundo agradecimiento hacia la comunidad que nos formó. Iceinmyarea.org fue creado a partir de nuestro deseo de usar la educación y las oportunidades que hemos tenido la fortuna de recibir para retribuir a los vecindarios, amigos y familias que nos ayudaron a crecer. Nuestra misión es ayudar a mantener a nuestras comunidades informadas, conectadas y seguras. Para nosotros, esto es mucho más que un proyecto: es una manera de proteger y elevar a la ciudad que admiramos y a los vecinos que nos importan.",
        "cTitle1": "La Comunidad Primero",
        "cDescription1": "Construido por la comunidad y para la comunidad. Creemos en el poder de la conciencia colectiva y el apoyo mutuo.",
        "cTitle2": "Seguridad y Privacidad",
        "cDescription2": "Tu seguridad es nuestra prioridad. Protegemos tu privacidad mientras te mantenemos informado sobre la actividad de ICE en tu área.",
        "cTitle3": "Devolver a la Comunidad",
        "cDescription3": "Usamos nuestra educación y oportunidades para proteger los vecindarios y familias que nos ayudaron a crecer.",
        "webTitle": "Por Qué Cambió el Sitio Web",
        "webPara1": "Nuestro sitio ha crecido rápidamente, con miles de personas en EE.UU. reportando actividad de ICE cada día. Con más de",
        "webPara2": "4,000 visitantes diarios",
        "webPara3": ", hemos mejorado la forma en que se verifican los reportes para hacer nuestra información más",
        "webPara4": "precisa, confiable y útil",
        "webPara5": "para la comunidad.",
        "webPara6": "Ahora cada reporte es",
        "webPara7": "revisado por una persona real",
        "webPara8": "para confirmar su exactitud — haciendo nuestra plataforma una de las",
        "webPara9": "herramientas más confiables para rastrear actividad de ICE",
        "webPara10": "a nivel nacional.",
        "verifyTitle": "Cómo se Verifican los Reportes",
        "verifyDescription": "Desplázate por nuestro proceso de verificación de tres pasos para ver cómo aseguramos precisión y confiabilidad",
        "contactTitle": "Contáctanos",
        "contactP1": "¿Tienes preguntas o necesitas ayuda? Estamos aquí para apoyarte.",
        "contactP2": "Para emergencias o asistencia legal inmediata, por favor contacta directamente a un abogado de inmigración u organización de ayuda legal."
    },
    "verificationTimeline": {
        "step1": {
            "title": "Reporte Enviado",
            "description": "Un miembro de la comunidad envía un reporte con detalles y ubicación.",
            "info": "Los reportes incluyen ubicación, hora, información adicional y evidencia fotográfica."
        },
        "step2": {
            "title": "Revisado por una Persona",
            "description": "Un verificador real revisa la exactitud y el contexto.",
            "info": "Nuestro equipo de verificación compara detalles, revisa duplicados y confirma la autenticidad."
        },
        "step3": {
            "title": "Visible en Tiempo Real",
            "description": "Los reportes verificados aparecen en vivo para todos.",
            "info": "Los reportes verificados aparecen instantáneamente en el mapa, ayudando a que las comunidades se mantengan informadas y seguras."
        }
    },
    "resourcesPage": {
        "title": "Recursos",
        "description": "Aquí encontrarás recursos útiles para conocer tus derechos y encontrar asistencia legal.",
        "subTitle1": "Pasos a Seguir si un Ser Querido es Detenido",
        "resource1": {
            "title": "Confirmar Detención por ICE",
            "description": "Usa el Sistema de Localización de Detenidos de ICE para confirmar su ubicación y estatus. Ten a la mano el nombre completo, fecha de nacimiento y país de origen de la persona.",
            "button": "Localizador de Detenidos de ICE"
        },
        "resource2": {
            "title": "Comunícate con tu Ser Querido",
            "description": "Encuentra información de contacto de centros de detención, reglas de visita y guías de comunicación para mantenerte en contacto con familiares detenidos.",
            "button": "Centros de Detención"
        },
        "subTitle2": "Recursos Adicionales",
        "resource3": {
            "title": "Encuentra Ayuda Legal Cerca de Ti",
            "description": "Busca en el Directorio Nacional de Servicios Legales de Inmigración para encontrar organizaciones de asistencia legal gratuita o de bajo costo en EE.UU.",
            "button": "Buscar Servicios Legales"
        },
        "resource4": {
            "title": "Lleva Tus Derechos Contigo",
            "description": "Tarjeta de bolsillo ‘Conoce Tus Derechos’ del Immigrant Legal Resource Center (ILRC). Disponible en varios idiomas.",
            "button": "Descargar Tarjeta"
        },
        "resource5": {
            "title": "Tenemos Derechos",
            "description": "Plan de Emergencia y Recursos de Brooklyn Defender Services. Guía paso a paso para encuentros con ICE, con videos y recursos legales.",
            "button": "Ver Recursos"
        }
    },
    "maintenance": {
        "title": "Sección en Mantenimiento",
        "message": "Estamos haciendo mantenimiento. La parte de reportes va a estar disponible muy pronto."
    },
    "notice": {
        "message": "¿Te interesa donar?"
    },
    "donate-popup": {
        "title": "Apoya Nuestra Misión",
        "description": "Ayúdanos a mantener este recurso vital de seguridad gratuito y accesible",
        "reason": "Cada donación nos ayuda a cubrir los costos de verificar la precisión de las ubicaciones, mantener nuestros servidores y utilizar las herramientas esenciales que hacen funcionar el sitio. Tu contribución mantiene la plataforma en línea, confiable y accesible, para que las comunidades puedan mantenerse informadas y seguras.",
        "num1": "Acceso Gratuito",
        "num2": "Monitoreo",
        "button1": "Donar Ahora",
        "button2": "Tal Vez Después",
        "footer": "Somos una iniciativa impulsada por la comunidad. Gracias por tu apoyo."
    }
}