{
    "header": {
        "title": "Rastreador de Actividad de ICE",
        "subtitle": "Sistema Comunitario de Alertas de Seguridad"
    },
    "safetyAlert": {
        "title": "Información Importante",
        "description": "Esta herramienta permite al público reportar y rastrear avistamientos de ICE en tiempo real: revisa el mapa antes de viajar, comparte alertas, evita áreas con actividad reciente y conoce tus derechos si te abordan."
    },
    "howToUse": {
        "title": "Cómo Usar Esta Herramienta",
        "reporting": {
            "title": "📍 Reportar Actividad de ICE:",
            "items": [
                "Qué reportar: vehículos de ICE, retenes o detenciones.",
                "Dónde: usa la barra de ubicación para compartir detalles exactos (intersecciones, direcciones o puntos de referencia).",
                "Cuándo: envía reportes tan pronto como sea seguro hacerlo.",
                "Privacidad: todos los reportes son completamente anónimos."
            ]
        },
        "stayingSafe": {
            "title": "🛡️ Cómo Mantenerte Seguro:",
            "items": [
                "Consulta el mapa antes de salir",
                "Comparte alertas con familiares y amistades",
                "Evita zonas con actividad reciente de ICE",
                "Conoce tus derechos si ICE se te acerca"
            ]
        }
    },
    "form": {
        "title": "Reportar Actividad de ICE",
        "guidelines": {
            "title": "Guía Rápida de Reporte:",
            "activities": "Vehículos de ICE • Retenes • Redadas • Operativos",
            "examples": "Ejemplos: \"4th St y La Regina Ave, Downey CA\" o \"123 Main St, Los Ángeles CA\""
        },
        "fields": {
            "locationLabel": "Ubicación",
            "locationRequired": "Requerido",
            "locationPlaceholder": "Dirección, cruce o punto de referencia",
            "addDetails": "Agregar detalles (opcional)",
            "detailsLabel": "Detalles",
            "detailsPlaceholder": "Cantidad de vehículos, hora, oficiales vistos...",
            "charactersCount": "{count}/200"
        },
        "buttons": {
            "submit": "Enviar Reporte",
            "locating": "📍 Obteniendo ubicación...",
            "hide": "✕"
        },
        "errors": {
            "addressRequired": "La dirección es requerida",
            "negativeContent": "Por favor evita usar lenguaje negativo o abusivo en la información adicional. Ahora estás bloqueado para enviar reportes por 1 hora.",
            "invalidAddress": "Por favor proporciona una dirección válida que se pueda encontrar en el mapa",
            "generic": "Ocurrió un error al enviar el formulario",
            "network": "Error de red. Por favor verifica tu conexión e inténtalo de nuevo.",
            "cooldown": "Por favor espera {minutes} minutos más antes de enviar otro reporte."
        },
        "success": {
            "message": "Ubicación agregada exitosamente",
            "title": "✅ ¡Reporte de actividad de ICE enviado con éxito!",
            "location": "Ubicación: {address}",
            "thanks": "Gracias por ayudar a proteger tu comunidad. Comparte esta información con familiares y amistades."
        },
        "validation": {
            "enterAddress": "Por favor ingresa una dirección o ubicación",
            "noResults": "No se encontraron resultados. Estado: {status}",
            "apiError": "Error al llamar a la API de geocodificación de Google. Revisa la consola para más detalles.",
            "saveError": "Error al guardar en la base de datos. Revisa la consola para más detalles.",
            "rateLimitError": "Por favor espera antes de enviar otro reporte"
        },
        "confirmation": {
            "title": "🚨 CONFIRMAR REPORTE DE ACTIVIDAD DE ICE",
            "question": "¿Es esta la dirección/ubicación correcta donde viste actividad de ICE?",
            "address": "\"{address}\"",
            "instructions": "Haz clic en Aceptar para confirmar y enviar este reporte para ayudar a proteger tu comunidad.\nHaz clic en Cancelar para regresar y corregir la ubicación."
        }
    },
    "reportsList": {
        "title": "📍 Reportes Recientes de ICE",
        "loading": "Cargando reportes recientes...",
        "noReports": "Aún no hay reportes. ¡Ayuda a proteger tu comunidad reportando actividad de ICE!",
        "reported": "Reportado: {date}",
        "additionalInfo": "ℹ️ {info}",
        "total": "Total de reportes de ICE: {count}",
        "warning": "⚠️ Revisa antes de viajar – evita estas zonas",
        "search": "Buscar",
        "searchPlaceholder": "Buscar direcciones...",
        "filtered": "Encontrados:"
    },
    "map": {
        "loading": "Cargando reportes de ICE...",
        "popup": {
            "title": "🚨 Reporte de ICE",
            "additionalDetails": "ℹ️ Detalles adicionales:",
            "reported": "Reportado: {date}"
        }
    },
    "rights": {
        "title": "Conoce Tus Derechos",
        "iceApproaches": {
            "title": "Si ICE Se Acerca a Ti:",
            "items": [
                [
                    "Tienes el derecho de permanecer en silencio.",
                    "No tienes que responder preguntas sobre tu estatus migratorio, dónde naciste o tu ciudadanía."
                ],
                [
                    "No tienes que mostrar documentos a menos que estés conduciendo un vehículo",
                    "y la ley te exija mostrar tu licencia y registro."
                ],
                [
                    "Tienes el derecho de negarte a registros.",
                    "No tienes que dar consentimiento para que registren tu persona, tus pertenencias o tu hogar sin una orden judicial."
                ],
                [
                    "Pide un abogado.",
                    "Tienes el derecho de hablar con un abogado antes de responder preguntas."
                ],
                [
                    "No firmes nada.",
                    "Nunca firmes documentos de ICE sin consultar con un abogado."
                ],
                [
                    "Si eres detenido, tienes el derecho de hacer una llamada telefónica",
                    "a un abogado o a un contacto de confianza."
                ]
            ]
        },
        "emergencyContacts": {
            "title": "Contactos de Emergencia:",
            "items": [
                "Líneas directas de ayuda legal: Ten a la mano los números de teléfono de organizaciones confiables de asistencia legal en inmigración. Ellos pueden explicarte tus derechos, conectarte con abogados y guiarte durante encuentros con ICE.",
                "Redes de Respuesta Rápida: Identifica grupos locales de inmigrantes o de respuesta rápida que puedan ayudar si alguien es detenido. Pueden brindar apoyo en el terreno, defensa y conexiones con recursos de fianza o legales.",
                "Contactos de Confianza: Asegúrate de que al menos un amigo, familiar o persona de confianza conozca tu ubicación y pueda comunicarse contigo si es necesario."
            ],
            "top": "Mantener contactos importantes accesibles puede ayudarte a ti y a tus seres queridos a mantenerse seguros en situaciones inesperadas.",
            "bottom": "Guarda estos números en tu teléfono, en tu cartera o en una tarjeta de “Conozca Sus Derechos”. Considera llevar una pequeña lista en papel como respaldo en caso de que tu teléfono se pierda o sea confiscado."
        }
    },
    "footer": {
        "disclaimer": "Esta es una herramienta comunitaria para concientización sobre seguridad. Reporta información de manera responsable y verifica las alertas siempre que sea posible.",
        "emergency": "En caso de emergencia inmediata, contacta a los servicios de emergencia locales. Para ayuda legal de inmigración, acude a organizaciones legales calificadas."
    },
    "common": {
        "hide": "Ocultar",
        "close": "✕",
        "required": "*",
        "optional": "(opcional)"
    },
    "reportNumbers": {
        "totalReports": "Total de Reportes",
        "todayReports": "Reportes de Hoy",
        "weekReports": "Reportes de la Semana"
    },
    "resources": {
        "title": "Recursos",
        "subtitle": "Aquí encontrarás recursos útiles para conocer tus derechos y obtener asistencia legal.",
        "resourceSection1": "Pasos a Seguir si un Ser Querido es Detenido",
        "resourceSection2": "Recursos Adicionales",
        "resourcesLinks": {
            "resource1": {
                "title": "Confirmar Detención por ICE",
                "link": "https://locator.ice.gov"
            },
            "resource2": {
                "title": "Contactar a tu Ser Querido",
                "link": "https://ice.gov/detention-facilities"
            }
        },
        "additionalResources": {
            "resource1": {
                "title": "Encuentra Ayuda Legal Cerca de Ti",
                "description": "Busca en el Directorio Nacional de Servicios Legales de Inmigración para localizar organizaciones que ofrecen asistencia legal gratuita o de bajo costo en todo EE. UU., y conéctate rápidamente con recursos de confianza en tu área.",
                "link": "https://www.immigrationadvocates.org/nonprofit/legaldirectory"
            },
            "resource2": {
                "title": "Lleva Tus Derechos Contigo",
                "description": "Esta tarjeta de bolsillo de Conozca Sus Derechos, creada por el Immigrant Legal Resource Center (ILRC), te ayuda a hacer valer tus derechos durante encuentros con ICE o las fuerzas del orden. Disponible en varios idiomas, es fácil de imprimir, llevar y mostrar cuando sea necesario.",
                "link": "https://www.nilc.org/resources/know-your-rights-card/"
            },
            "resource3": {
                "title": "Tenemos Derechos – Plan de Emergencia y Recursos",
                "description": "Prepárate tú y tus seres queridos con el Plan de Emergencia de Tenemos Derechos, una guía gratuita y pública del Brooklyn Defender Services. Proporciona instrucciones paso a paso para encuentros con ICE e incluye enlaces a videos y recursos legales adicionales. Disponible en inglés, español y otros idiomas para un fácil acceso e impresión.",
                "link": "https://www.wehaverights.us/"
            }
        }
    },
    "maintenance": {
        "title": "Sección en Mantenimiento",
        "message": "Estamos haciendo mantenimiento. La parte de reportes va a estar disponible muy pronto."
    },
    "donate-button": {
        "title": "Donar"
    },
    "notice": {
        "message": "¿Te interesa donar?"
    },
    "donate-popup": {
        "title": "Apoya Nuestra Misión",
        "description": "Ayúdanos a mantener este recurso vital de seguridad gratuito y accesible",
        "reason": "Cada donación nos ayuda a cubrir los costos de verificar la precisión de las ubicaciones, mantener nuestros servidores y utilizar las herramientas esenciales que hacen funcionar el sitio. Tu contribución mantiene la plataforma en línea, confiable y accesible, para que las comunidades puedan mantenerse informadas y seguras.",
        "num1": "Acceso Gratuito",
        "num2": "Monitoreo",
        "button1": "Donar Ahora",
        "button2": "Tal Vez Después",
        "footer": "Somos una iniciativa impulsada por la comunidad. Gracias por tu apoyo."
    }
}